rm(list=ls())

# 2019 11월
a<-read.csv("2019-11월_시도별_등기소포(택배)정보/강원도_등기소포(택배)정보_201911.csv",header=T, sep=",")

b<-read.csv("2019-11월_시도별_등기소포(택배)정보/경기도_등기소포(택배)정보_201911.csv",header=T, sep=",")

c<-read.csv("2019-11월_시도별_등기소포(택배)정보/경상남도_등기소포(택배)정보_201911.csv",header=T, sep=",")

d<-read.csv("2019-11월_시도별_등기소포(택배)정보/경상북도_등기소포(택배)정보_201911.csv",header=T, sep=",")

e<-read.csv("2019-11월_시도별_등기소포(택배)정보/광주광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

f<-read.csv("2019-11월_시도별_등기소포(택배)정보/대구광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

g<-read.csv("2019-11월_시도별_등기소포(택배)정보/대전광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

h<-read.csv("2019-11월_시도별_등기소포(택배)정보/부산광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

i<-read.csv("2019-11월_시도별_등기소포(택배)정보/서울특별시_등기소포(택배)정보_201911.csv",header=T, sep=",")

j<-read.csv("2019-11월_시도별_등기소포(택배)정보/세종특별자치시_등기소포(택배)정보_201911.csv",header=T, sep=",")

k<-read.csv("2019-11월_시도별_등기소포(택배)정보/울산광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

l<-read.csv("2019-11월_시도별_등기소포(택배)정보/인천광역시_등기소포(택배)정보_201911.csv",header=T, sep=",")

m<-read.csv("2019-11월_시도별_등기소포(택배)정보/전라남도_등기소포(택배)정보_201911.csv",header=T, sep=",")

n<-read.csv("2019-11월_시도별_등기소포(택배)정보/전라북도_등기소포(택배)정보_201911.csv",header=T, sep=",")

o<-read.csv("2019-11월_시도별_등기소포(택배)정보/제주특별자치도_등기소포(택배)정보_201911.csv",header=T, sep=",")

p<-read.csv("2019-11월_시도별_등기소포(택배)정보/충청남도_등기소포(택배)정보_201911.csv",header=T, sep=",")

q<-read.csv("2019-11월_시도별_등기소포(택배)정보/충청북도_등기소포(택배)정보_201911.csv",header=T, sep=",")

Nov2019<-rbind(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)

library(tidyverse)
Nov2019<-Nov2019%>%group_by(접수일자)%>%summarize(count=n())


# 2019 12월

a<-read.csv("2019-12월_시도별_등기소포(택배)정보/강원도_등기소포(택배)정보_201912.csv",header=T, sep=",")

b<-read.csv("2019-12월_시도별_등기소포(택배)정보/경기도_등기소포(택배)정보_201912.csv",header=T, sep=",")

c<-read.csv("2019-12월_시도별_등기소포(택배)정보/경상남도_등기소포(택배)정보_201912.csv",header=T, sep=",")

d<-read.csv("2019-12월_시도별_등기소포(택배)정보/경상북도_등기소포(택배)정보_201912.csv",header=T, sep=",")

e<-read.csv("2019-12월_시도별_등기소포(택배)정보/광주광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

f<-read.csv("2019-12월_시도별_등기소포(택배)정보/대구광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

g<-read.csv("2019-12월_시도별_등기소포(택배)정보/대전광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

h<-read.csv("2019-12월_시도별_등기소포(택배)정보/부산광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

i<-read.csv("2019-12월_시도별_등기소포(택배)정보/서울특별시_등기소포(택배)정보_201912.csv",header=T, sep=",")

j<-read.csv("2019-12월_시도별_등기소포(택배)정보/세종특별자치시_등기소포(택배)정보_201912.csv",header=T, sep=",")

k<-read.csv("2019-12월_시도별_등기소포(택배)정보/울산광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

l<-read.csv("2019-12월_시도별_등기소포(택배)정보/인천광역시_등기소포(택배)정보_201912.csv",header=T, sep=",")

m<-read.csv("2019-12월_시도별_등기소포(택배)정보/전라남도_등기소포(택배)정보_201912.csv",header=T, sep=",")

n<-read.csv("2019-12월_시도별_등기소포(택배)정보/전라북도_등기소포(택배)정보_201912.csv",header=T, sep=",")

o<-read.csv("2019-12월_시도별_등기소포(택배)정보/제주특별자치도_등기소포(택배)정보_201912.csv",header=T, sep=",")

p<-read.csv("2019-12월_시도별_등기소포(택배)정보/충청남도_등기소포(택배)정보_201912.csv",header=T, sep=",")

q<-read.csv("2019-12월_시도별_등기소포(택배)정보/충청북도_등기소포(택배)정보_201912.csv",header=T, sep=",")

Dec2019<-rbind(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)

Dec2019<-Dec2019%>%group_by(접수일자)%>%summarize(count=n())



# 2020 1월


a<-read.csv("2020-1월_시도별_등기소포(택배)정보/강원도_등기소포(택배)정보_202001.csv",header=T, sep=",")

b<-read.csv("2020-1월_시도별_등기소포(택배)정보/경기도_등기소포(택배)정보_202001.csv",header=T, sep=",")

c<-read.csv("2020-1월_시도별_등기소포(택배)정보/경상남도_등기소포(택배)정보_202001.csv",header=T, sep=",")

d<-read.csv("2020-1월_시도별_등기소포(택배)정보/경상북도_등기소포(택배)정보_202001.csv",header=T, sep=",")

e<-read.csv("2020-1월_시도별_등기소포(택배)정보/광주광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

f<-read.csv("2020-1월_시도별_등기소포(택배)정보/대구광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

g<-read.csv("2020-1월_시도별_등기소포(택배)정보/대전광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

h<-read.csv("2020-1월_시도별_등기소포(택배)정보/부산광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

i<-read.csv("2020-1월_시도별_등기소포(택배)정보/서울특별시_등기소포(택배)정보_202001.csv",header=T, sep=",")

j<-read.csv("2020-1월_시도별_등기소포(택배)정보/세종특별자치시_등기소포(택배)정보_202001.csv",header=T, sep=",")

k<-read.csv("2020-1월_시도별_등기소포(택배)정보/울산광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

l<-read.csv("2020-1월_시도별_등기소포(택배)정보/인천광역시_등기소포(택배)정보_202001.csv",header=T, sep=",")

m<-read.csv("2020-1월_시도별_등기소포(택배)정보/전라남도_등기소포(택배)정보_202001.csv",header=T, sep=",")

n<-read.csv("2020-1월_시도별_등기소포(택배)정보/전라북도_등기소포(택배)정보_202001.csv",header=T, sep=",")

o<-read.csv("2020-1월_시도별_등기소포(택배)정보/제주특별자치도_등기소포(택배)정보_202001.csv",header=T, sep=",")

p<-read.csv("2020-1월_시도별_등기소포(택배)정보/충청남도_등기소포(택배)정보_202001.csv",header=T, sep=",")

q<-read.csv("2020-1월_시도별_등기소포(택배)정보/충청북도_등기소포(택배)정보_202001.csv",header=T, sep=",")

Jan2020<-rbind(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)

Jan2020<-Jan2020%>%group_by(접수일자)%>%summarize(count=n())


# 2020 2월


a<-read.csv("2020-2월_시도별_등기소포(택배)정보/강원도_등기소포(택배)정보_202002.csv",header=T, sep=",")

b<-read.csv("2020-2월_시도별_등기소포(택배)정보/경기도_등기소포(택배)정보_202002.csv",header=T, sep=",")

c<-read.csv("2020-2월_시도별_등기소포(택배)정보/경상남도_등기소포(택배)정보_202002.csv",header=T, sep=",")

d<-read.csv("2020-2월_시도별_등기소포(택배)정보/경상북도_등기소포(택배)정보_202002.csv",header=T, sep=",")

e<-read.csv("2020-2월_시도별_등기소포(택배)정보/광주광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

f<-read.csv("2020-2월_시도별_등기소포(택배)정보/대구광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

g<-read.csv("2020-2월_시도별_등기소포(택배)정보/대전광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

h<-read.csv("2020-2월_시도별_등기소포(택배)정보/부산광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

i<-read.csv("2020-2월_시도별_등기소포(택배)정보/서울특별시_등기소포(택배)정보_202002.csv",header=T, sep=",")

j<-read.csv("2020-2월_시도별_등기소포(택배)정보/세종특별자치시_등기소포(택배)정보_202002.csv",header=T, sep=",")

k<-read.csv("2020-2월_시도별_등기소포(택배)정보/울산광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

l<-read.csv("2020-2월_시도별_등기소포(택배)정보/인천광역시_등기소포(택배)정보_202002.csv",header=T, sep=",")

m<-read.csv("2020-2월_시도별_등기소포(택배)정보/전라남도_등기소포(택배)정보_202002.csv",header=T, sep=",")

n<-read.csv("2020-2월_시도별_등기소포(택배)정보/전라북도_등기소포(택배)정보_202002.csv",header=T, sep=",")

o<-read.csv("2020-2월_시도별_등기소포(택배)정보/제주특별자치도_등기소포(택배)정보_202002.csv",header=T, sep=",")

p<-read.csv("2020-2월_시도별_등기소포(택배)정보/충청남도_등기소포(택배)정보_202002.csv",header=T, sep=",")

q<-read.csv("2020-2월_시도별_등기소포(택배)정보/충청북도_등기소포(택배)정보_202002.csv",header=T, sep=",")

Feb2020<-rbind(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)

Feb2020<-Feb2020%>%group_by(접수일자)%>%summarize(count=n())


# 2020 3월


a<-read.csv("2020-3월_시도별_등기소포(택배)정보/강원도_등기소포(택배)정보_202003.csv",header=T, sep=",")

b<-read.csv("2020-3월_시도별_등기소포(택배)정보/경기도_등기소포(택배)정보_202003.csv",header=T, sep=",")

c<-read.csv("2020-3월_시도별_등기소포(택배)정보/경상남도_등기소포(택배)정보_202003.csv",header=T, sep=",")

d<-read.csv("2020-3월_시도별_등기소포(택배)정보/경상북도_등기소포(택배)정보_202003.csv",header=T, sep=",")

e<-read.csv("2020-3월_시도별_등기소포(택배)정보/광주광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

f<-read.csv("2020-3월_시도별_등기소포(택배)정보/대구광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

g<-read.csv("2020-3월_시도별_등기소포(택배)정보/대전광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

h<-read.csv("2020-3월_시도별_등기소포(택배)정보/부산광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

i<-read.csv("2020-3월_시도별_등기소포(택배)정보/서울특별시_등기소포(택배)정보_202003.csv",header=T, sep=",")

j<-read.csv("2020-3월_시도별_등기소포(택배)정보/세종특별자치시_등기소포(택배)정보_202003.csv",header=T, sep=",")

k<-read.csv("2020-3월_시도별_등기소포(택배)정보/울산광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

l<-read.csv("2020-3월_시도별_등기소포(택배)정보/인천광역시_등기소포(택배)정보_202003.csv",header=T, sep=",")

m<-read.csv("2020-3월_시도별_등기소포(택배)정보/전라남도_등기소포(택배)정보_202003.csv",header=T, sep=",")

n<-read.csv("2020-3월_시도별_등기소포(택배)정보/전라북도_등기소포(택배)정보_202003.csv",header=T, sep=",")

o<-read.csv("2020-3월_시도별_등기소포(택배)정보/제주특별자치도_등기소포(택배)정보_202003.csv",header=T, sep=",")

p<-read.csv("2020-3월_시도별_등기소포(택배)정보/충청남도_등기소포(택배)정보_202003.csv",header=T, sep=",")

q<-read.csv("2020-3월_시도별_등기소포(택배)정보/충청북도_등기소포(택배)정보_202003.csv",header=T, sep=",")

March2020<-rbind(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)

March2020<-March2020%>%group_by(접수일자)%>%summarize(count=n())


Nov2019_March2020<-rbind(Nov2019, Dec2019, Jan2020, Feb2020, March2020)

install.packages("writexl")

library(writexl)
write.csv(Nov2019_March2020,"Nov2019_March2020.csv")
